       IDENTIFICATION        DIVISION.
       PROGRAM-ID. OLACOBOL.
      * COMENTARIO     
       PROCEDURE             DIVISION.
           DISPLAY "OLA COBOL".
           STOP  RUN.